Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl602_driver/regs/ir_reg.h
    /* 0x10 : irtx_pulse_width */
    union {
        struct
        {
            uint32_t cr_irtx_pw_unit   : 12; /* [11: 0],        r/w,      0x464 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t cr_irtx_mod_ph0_w : 8;  /* [23:16],        r/w,       0x11 */
            uint32_t cr_irtx_mod_ph1_w : 8;  /* [31:24],        r/w,       0x22 */
        } BF;
        uint32_t WORD;
    } irtx_pulse_width;

    /* 0x14 : irtx_pw */
    union {
        struct
        {
            uint32_t cr_irtx_logic0_ph0_w : 4; /* [ 3: 0],        r/w,        0x0 */
            uint32_t cr_irtx_logic0_ph1_w : 4; /* [ 7: 4],        r/w,        0x0 */
            uint32_t cr_irtx_logic1_ph0_w : 4; /* [11: 8],        r/w,        0x0 */
            uint32_t cr_irtx_logic1_ph1_w : 4; /* [15:12],        r/w,        0x2 */
            uint32_t cr_irtx_head_ph0_w   : 4; /* [19:16],        r/w,        0xf */
            uint32_t cr_irtx_head_ph1_w   : 4; /* [23:20],        r/w,        0x7 */
            uint32_t cr_irtx_tail_ph0_w   : 4; /* [27:24],        r/w,        0x0 */
            uint32_t cr_irtx_tail_ph1_w   : 4; /* [31:28],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } irtx_pw;

    /* 0x18  reserved */
    uint8_t RESERVED0x18[40];

    /* 0x40 : irtx_swm_pw_0 */
    union {
        struct
        {
            uint32_t cr_irtx_swm_pw_0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } irtx_swm_pw_0;

    /* 0x44 : irtx_swm_pw_1 */
    union {
        struct
        {
            uint32_t cr_irtx_swm_pw_1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } irtx_swm_pw_1;

    /* 0x48 : irtx_swm_pw_2 */
    union {
        struct
        {
            uint32_t cr_irtx_swm_pw_2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } irtx_swm_pw_2;

    /* 0x4C : irtx_swm_pw_3 */
    union {
        struct
        {
            uint32_t cr_irtx_swm_pw_3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } irtx_swm_pw_3;

    /* 0x50 : irtx_swm_pw_4 */
    union {
        struct
        {
            uint32_t cr_irtx_swm_pw_4 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } irtx_swm_pw_4;

    /* 0x54 : irtx_swm_pw_5 */
    union {
        struct
        {
            uint32_t cr_irtx_swm_pw_5 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } irtx_swm_pw_5;

    /* 0x58 : irtx_swm_pw_6 */
    union {
        struct
        {
            uint32_t cr_irtx_swm_pw_6 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } irtx_swm_pw_6;

    /* 0x5C : irtx_swm_pw_7 */
    union {
        struct
        {
            uint32_t cr_irtx_swm_pw_7 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } irtx_swm_pw_7;

    /* 0x60  reserved */
    uint8_t RESERVED0x60[32];

    /* 0x80 : irrx_config */
    union {
        struct
        {
            uint32_t cr_irrx_en      : 1;  /* [    0],        r/w,        0x0 */
            uint32_t cr_irrx_in_inv  : 1;  /* [    1],        r/w,        0x1 */
            uint32_t cr_irrx_mode    : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t cr_irrx_deg_en  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_7    : 3;  /* [ 7: 5],       rsvd,        0x0 */
            uint32_t cr_irrx_deg_cnt : 4;  /* [11: 8],        r/w,        0x0 */
            uint32_t reserved_12_31  : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } irrx_config;

    /* 0x84 : irrx_int_sts */
    union {
        struct
        {
            uint32_t irrx_end_int     : 1; /* [    0],          r,        0x0 */
            uint32_t reserved_1_7     : 7; /* [ 7: 1],       rsvd,        0x0 */
            uint32_t cr_irrx_end_mask : 1; /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_15    : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t cr_irrx_end_clr  : 1; /* [   16],        w1c,        0x0 */
            uint32_t reserved_17_23   : 7; /* [23:17],       rsvd,        0x0 */
            uint32_t cr_irrx_end_en   : 1; /* [   24],        r/w,        0x1 */
            uint32_t reserved_25_31   : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } irrx_int_sts;

    /* 0x88 : irrx_pw_config */
    union {
        struct
        {
            uint32_t cr_irrx_data_th : 16; /* [15: 0],        r/w,      0xd47 */
            uint32_t cr_irrx_end_th  : 16; /* [31:16],        r/w,     0x2327 */
        } BF;
        uint32_t WORD;
    } irrx_pw_config;

    /* 0x8c  reserved */
    uint8_t RESERVED0x8c[4];

    /* 0x90 : irrx_data_count */
    union {
        struct
        {
            uint32_t sts_irrx_data_cnt : 7;  /* [ 6: 0],          r,        0x0 */
            uint32_t reserved_7_31     : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } irrx_data_count;

    /* 0x94 : irrx_data_word0 */
    union {
        struct
        {
            uint32_t sts_irrx_data_word0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } irrx_data_word0;

    /* 0x98 : irrx_data_word1 */
    union {
        struct
        {
            uint32_t sts_irrx_data_word1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } irrx_data_word1;

    /* 0x9c  reserved */
    uint8_t RESERVED0x9c[36];

    /* 0xC0 : irrx_swm_fifo_config_0 */
    union {
        struct
        {
            uint32_t rx_fifo_clr       : 1;  /* [    0],        w1c,        0x0 */
            uint32_t reserved_1        : 1;  /* [    1],       rsvd,        0x0 */
            uint32_t rx_fifo_overflow  : 1;  /* [    2],          r,        0x0 */
            uint32_t rx_fifo_underflow : 1;  /* [    3],          r,        0x0 */
            uint32_t rx_fifo_cnt       : 7;  /* [10: 4],          r,        0x0 */
            uint32_t reserved_11_31    : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } irrx_swm_fifo_config_0;

    /* 0xC4 : irrx_swm_fifo_rdata */
    union {
        struct
        {
            uint32_t rx_fifo_rdata  : 16; /* [15: 0],          r,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } irrx_swm_fifo_rdata;
};

typedef volatile struct ir_reg ir_reg_t;

#endif /* __IR_REG_H__ */
